#include <stdio.h>
#include <unistd.h>
#include "u8g2.h"
#include "u8g2_font_khmer.h"

u8g2_t u8g2;

const char *str[] = {
  "ទី១ទី២ទី៣",
  "ក ខ គ ឃ ង ច ឆ ជ ឈ ញ ដ ឋ ឌ ឍ ណ ត ថ ទ ធ ន ប ផ ព ភ ម",
  "យ រ ល វ ឝ ឞ ស ហ ឡ អ ឥ ឦ ឧ ឨ ឩ ឪ ឫ ឬ ឭ ឮ ឯ ឰ ឱ ឲ ឳ",
  "០ ១ ២ ៣ ៤ ៥ ៦ ៧ ៨ ៩ ៛ ។ ៕ ៖ ៗ ។ល។",
  "",
  "ក្ក ខ្ខ គ្គ ឃ្ឃ ង្ង ច្ច ឆ្ឆ ជ្ជ ឈ្ឈ ញ្ញ ដ្ដ ឋ្ឋ ឌ្ឌ ឍ្ឍ ណ្ណ ត្ត ថ្ថ ទ្ទ ធ្ធ ន្ន ប្ប ផ្ផ ព្ព ភ្ភ ម្ម",
  "យ្យ រ្រ ល្ល វ្វ ឝ្ឝ ឞ្ឞ ស្ស ហ្ហ ឡ អ្អ កិកីកឹកឺ",
  "",
  "វិទ្យាសាស្ត្រ​អនុវត្តន៍ បរិយាកាសចម្រើនសុខភាព​",
  "សេចក្ដី​ប្រឹងប្រែង​ក្នុង​ជីវិត ទឡ្ហីករណ៍​នៅ​ក្នុង​តុលាការ",
  "",
  "Title: Pre-base Vowels and Above-base Marks",
  "កិ​ខិ​គិ​ឃិ​ងិ​ចិ​ឆិ​ជិ​ឈិ​ញិ​ដិ​ឋិ​ឌិ​ឍិ​ណិ​តិ​ថិ​ទិ​ធិ​និ​បិ​ផិ​ពិ​ភិ​មិ​យិ​រិ​លិ​វិ​ឝិ​ឞិ​សិ​ហិ​ឡិ​អិ​ ក្ឃិក្ឈិក្ឍិក្បិក្យិក្ឞិក្សិ",
  "កី​ខី​គី​ឃី​ងី​ចី​ឆី​ជី​ឈី​ញី​ដី​ឋី​ឌី​ឍី​ណី​តី​ថី​ទី​ធី​នី​បី​ផី​ពី​ភី​មី​យី​រី​លី​វី​ឝី​ឞី​សី​ហី​ឡី​អី​ ក្ឃីក្ឈីក្ឍីក្បីក្យីក្ឞីក្សី",
  "កឹ​ខឹ​គឹ​ឃឹ​ងឹ​ចឹ​ឆឹ​ជឹ​ឈឹ​ញឹ​ដឹ​ឋឹ​ឌឹ​ឍឹ​ណឹ​តឹ​ថឹ​ទឹ​ធឹ​នឹ​បឹ​ផឹ​ពឹ​ភឹ​មឹ​យឹ​រឹ​លឹ​វឹ​ឝឹ​ឞឹ​សឹ​ហឹ​ឡឹ​អឹ​ ក្ឃឹក្ឈឹក្ឍឹក្បឹក្យឹក្ឞឹក្សឹ",
  "កឺ​ខឺ​គឺ​ឃឺ​ងឺ​ចឺ​ឆឺ​ជឺ​ឈឺ​ញឺ​ដឺ​ឋឺ​ឌឺ​ឍឺ​ណឺ​តឺ​ថឺ​ទឺ​ធឺ​នឺ​បឺ​ផឺ​ពឺ​ភឺ​មឺ​យឺ​រឺ​លឺ​វឺ​ឝឺ​ឞឺ​សឺ​ហឺ​ឡឺ​អឺ​ ក្ឃឺក្ឈឺក្ឍឺក្បឺក្យឺក្ឞឺក្សឺ",
  "កុ​ខុ​គុ​ឃុ​ងុ​ចុ​ឆុ​ជុ​ឈុ​ញុ​ដុ​ឋុ​ឌុ​ឍុ​ណុ​តុ​ថុ​ទុ​ធុ​នុ​បុ​ផុ​ពុ​ភុ​មុ​យុ​រុ​លុ​វុ​ឝុ​ឞុ​សុ​ហុ​ឡុ​អុ​ ក្ឃុក្ឈុក្ឍុក្បុក្យុក្ឞុក្សុ",
  "កូ​ខូ​គូ​ឃូ​ងូ​ចូ​ឆូ​ជូ​ឈូ​ញូ​ដូ​ឋូ​ឌូ​ឍូ​ណូ​តូ​ថូ​ទូ​ធូ​នូ​បូ​ផូ​ពូ​ភូ​មូ​យូ​រូ​លូ​វូ​ឝូ​ឞូ​សូ​ហូ​ឡូ​អូ​ ក្ឃូក្ឈូក្ឍូក្បូក្យូក្ឞូក្សូ",
  "កួ​ខួ​គួ​ឃួ​ងួ​ចួ​ឆួ​ជួ​ឈួ​ញួ​ដួ​ឋួ​ឌួ​ឍួ​ណួ​តួ​ថួ​ទួ​ធួ​នួ​បួ​ផួ​ពួ​ភួ​មួ​យួ​រួ​លួ​វួ​ឝួ​ឞួ​សួ​ហួ​ឡួ​អួ​ ក្ឃួក្ឈួក្ឍួក្បួក្យួក្ឞួក្សួ",
  "កំ​ខំ​គំ​ឃំ​ងំ​ចំ​ឆំ​ជំ​ឈំ​ញំ​ដំ​ឋំ​ឌំ​ឍំ​ណំ​តំ​ថំ​ទំ​ធំ​នំ​បំ​ផំ​ពំ​ភំ​មំ​យំ​រំ​លំ​វំ​ឝំ​ឞំ​សំ​ហំ​ឡំ​អំ​ ក្ឃំក្ឈំក្ឍំក្បំក្យំក្ឞំក្សំ",
  "ក៉​ខ៉​គ៉​ឃ៉​ង៉​ច៉​ឆ៉​ជ៉​ឈ៉​ញ៉​ដ៉​ឋ៉​ឌ៉​ឍ៉​ណ៉​ត៉​ថ៉​ទ៉​ធ៉​ន៉​ប៉​ផ៉​ព៉​ភ៉​ម៉​យ៉​រ៉​ល៉​វ៉​ឝ៉​ឞ៉​ស៉​ហ៉​ឡ៉​អ៉​ ក្ឃ៉ក្ឈ៉ក្ឍ៉ក្ប៉ក្យ៉ក្ឞ៉ក្ស៉",
  "ក៊​ខ៊​គ៊​ឃ៊​ង៊​ច៊​ឆ៊​ជ៊​ឈ៊​ញ៊​ដ៊​ឋ៊​ឌ៊​ឍ៊​ណ៊​ត៊​ថ៊​ទ៊​ធ៊​ន៊​ប៊​ផ៊​ព៊​ភ៊​ម៊​យ៊​រ៊​ល៊​វ៊​ឝ៊​ឞ៊​ស៊​ហ៊​ឡ៊​អ៊​ ក្ឃ៊ក្ឈ៊ក្ឍ៊ក្ប៊ក្យ៊ក្ឞ៊ក្ស៊",
  "ក់​ខ់​គ់​ឃ់​ង់​ច់​ឆ់​ជ់​ឈ់​ញ់​ដ់​ឋ់​ឌ់​ឍ់​ណ់​ត់​ថ់​ទ់​ធ់​ន់​ប់​ផ់​ព់​ភ់​ម់​យ់​រ់​ល់​វ់​ឝ់​ឞ់​ស់​ហ់​ឡ់​អ់​ ក្ឃ់ក្ឈ់ក្ឍ់ក្ប់ក្យ់ក្ឞ់ក្ស់",
  "ក៌​ខ៌​គ៌​ឃ៌​ង៌​ច៌​ឆ៌​ជ៌​ឈ៌​ញ៌​ដ៌​ឋ៌​ឌ៌​ឍ៌​ណ៌​ត៌​ថ៌​ទ៌​ធ៌​ន៌​ប៌​ផ៌​ព៌​ភ៌​ម៌​យ៌​រ៌​ល៌​វ៌​ឝ៌​ឞ៌​ស៌​ហ៌​ឡ៌​អ៌​ ",
  "ក៍​ខ៍​គ៍​ឃ៍​ង៍​ច៍​ឆ៍​ជ៍​ឈ៍​ញ៍​ដ៍​ឋ៍​ឌ៍​ឍ៍​ណ៍​ត៍​ថ៍​ទ៍​ធ៍​ន៍​ប៍​ផ៍​ព៍​ភ៍​ម៍​យ៍​រ៍​ល៍​វ៍​ឝ៍​ឞ៍​ស៍​ហ៍​ឡ៍​អ៍​ ក្ឃ៍ក្ឈ៍ក្ឍ៍ក្ប៍ក្យ៍ក្ឞ៍ក្ស៍",
  "ក៎​ខ៎​គ៎​ឃ៎​ង៎​ច៎​ឆ៎​ជ៎​ឈ៎​ញ៎​ដ៎​ឋ៎​ឌ៎​ឍ៎​ណ៎​ត៎​ថ៎​ទ៎​ធ៎​ន៎​ប៎​ផ៎​ព៎​ភ៎​ម៎​យ៎​រ៎​ល៎​វ៎​ឝ៎​ឞ៎​ស៎​ហ៎​ឡ៎​អ៎​ ក្ឃ៎ក្ឈ៎ក្ឍ៎ក្ប៎ក្យ៎ក្ឞ៎ក្ស៎",
  "ក៏​ខ៏​គ៏​ឃ៏​ង៏​ច៏​ឆ៏​ជ៏​ឈ៏​ញ៏​ដ៏​ឋ៏​ឌ៏​ឍ៏​ណ៏​ត៏​ថ៏​ទ៏​ធ៏​ន៏​ប៏​ផ៏​ព៏​ភ៏​ម៏​យ៏​រ៏​ល៏​វ៏​ឝ៏​ឞ៏​ស៏​ហ៏​ឡ៏​អ៏​ ",
  "ក័​ខ័​គ័​ឃ័​ង័​ច័​ឆ័​ជ័​ឈ័​ញ័​ដ័​ឋ័​ឌ័​ឍ័​ណ័​ត័​ថ័​ទ័​ធ័​ន័​ប័​ផ័​ព័​ភ័​ម័​យ័​រ័​ល័​វ័​ឝ័​ឞ័​ស័​ហ័​ឡ័​អ័​ ក្ឃ៏ក្ឈ៏ក្ឍ៏ក្ប៏ក្យ៏ក្ឞ៏ក្ស៏",
  "",
  "កេ​ខេ​គេ​ឃេ​ងេ​ចេ​ឆេ​ជេ​ឈេ​ញេ​ដេ​ឋេ​ឌេ​ឍេ​ណេ​តេ​ថេ​ទេ​ធេ​នេ​បេ​ផេ​ពេ​ភេ​មេ​យេ​រេ​លេ​វេ​ឝេ​ឞេ​សេ​ហេ​ឡេ​អេ​",
  "កែ​ខែ​គែ​ឃែ​ងែ​ចែ​ឆែ​ជែ​ឈែ​ញែ​ដែ​ឋែ​ឌែ​ឍែ​ណែ​តែ​ថែ​ទែ​ធែ​នែ​បែ​ផែ​ពែ​ភែ​មែ​យែ​រែ​លែ​វែ​ឝែ​ឞែ​សែ​ហែ​ឡែ​អែ​",
  "កៃ​ខៃ​គៃ​ឃៃ​ងៃ​ចៃ​ឆៃ​ជៃ​ឈៃ​ញៃ​ដៃ​ឋៃ​ឌៃ​ឍៃ​ណៃ​តៃ​ថៃ​ទៃ​ធៃ​នៃ​បៃ​ផៃ​ពៃ​ភៃ​មៃ​យៃ​រៃ​លៃ​វៃ​ឝៃ​ឞៃ​សៃ​ហៃ​ឡៃ​អៃ​",
  "ក៉េ​ខ៉េ​គ៉េ​ឃ៉េ​ង៉េ​ច៉េ​ឆ៉េ​ជ៉េ​ឈ៉េ​ញ៉េ​ដ៉េ​ឋ៉េ​ឌ៉េ​ឍ៉េ​ណ៉េ​ត៉េ​ថ៉េ​ទ៉េ​ធ៉េ​ន៉េ​ប៉េ​ផ៉េ​ព៉េ​ភ៉េ​ម៉េ​យ៉េ​រ៉េ​ល៉េ​វ៉េ​ឝ៉េ​ឞ៉េ​ស៉េ​ហ៉េ​ឡ៉េ​អ៉េ​",
  "ក៉ែ​ខ៉ែ​គ៉ែ​ឃ៉ែ​ង៉ែ​ច៉ែ​ឆ៉ែ​ជ៉ែ​ឈ៉ែ​ញ៉ែ​ដ៉ែ​ឋ៉ែ​ឌ៉ែ​ឍ៉ែ​ណ៉ែ​ត៉ែ​ថ៉ែ​ទ៉ែ​ធ៉ែ​ន៉ែ​ប៉ែ​ផ៉ែ​ព៉ែ​ភ៉ែ​ម៉ែ​យ៉ែ​រ៉ែ​ល៉ែ​វ៉ែ​ឝ៉ែ​ឞ៉ែ​ស៉ែ​ហ៉ែ​ឡ៉ែ​អ៉ែ​",
  "ក៉ៃ​ខ៉ៃ​គ៉ៃ​ឃ៉ៃ​ង៉ៃ​ច៉ៃ​ឆ៉ៃ​ជ៉ៃ​ឈ៉ៃ​ញ៉ៃ​ដ៉ៃ​ឋ៉ៃ​ឌ៉ៃ​ឍ៉ៃ​ណ៉ៃ​ត៉ៃ​ថ៉ៃ​ទ៉ៃ​ធ៉ៃ​ន៉ៃ​ប៉ៃ​ផ៉ៃ​ព៉ៃ​ភ៉ៃ​ម៉ៃ​យ៉ៃ​រ៉ៃ​ល៉ៃ​វ៉ៃ​ឝ៉ៃ​ឞ៉ៃ​ស៉ៃ​ហ៉ៃ​ឡ៉ៃ​អ៉ៃ​",
  "",
  "Title: Coeng Forms",
  "ក្ក​ខ្ក​គ្ក​ឃ្ក​ង្ក​ច្ក​ឆ្ក​ជ្ក​ឈ្ក​ញ្ក​ដ្ក​ឋ្ក​ឌ្ក​ឍ្ក​ត្ក​ថ្ក​ទ្ក​ធ្ក​ន្ក​ប្ក​ផ្ក​ព្ក​ភ្ក​ម្ក​យ្ក​រ្ក​ល្ក​វ្ក​ឝ្ក​ឞ្ក​ស្ក​ហ្ក​អ្ក​",
  "ក្ខ​ខ្ខ​គ្ខ​ឃ្ខ​ង្ខ​ច្ខ​ឆ្ខ​ជ្ខ​ឈ្ខ​ញ្ខ​ដ្ខ​ឋ្ខ​ឌ្ខ​ឍ្ខ​ត្ខ​ថ្ខ​ទ្ខ​ធ្ខ​ន្ខ​ប្ខ​ផ្ខ​ព្ខ​ភ្ខ​ម្ខ​យ្ខ​រ្ខ​ល្ខ​វ្ខ​ឝ្ខ​ឞ្ខ​ស្ខ​ហ្ខ​អ្ខ​",
  "ក្គ​ខ្គ​គ្គ​ឃ្គ​ង្គ​ច្គ​ឆ្គ​ជ្គ​ឈ្គ​ញ្គ​ដ្គ​ឋ្គ​ឌ្គ​ឍ្គ​ត្គ​ថ្គ​ទ្គ​ធ្គ​ន្គ​ប្គ​ផ្គ​ព្គ​ភ្គ​ម្គ​យ្គ​រ្គ​ល្គ​វ្គ​ឝ្គ​ឞ្គ​ស្គ​ហ្គ​អ្គ​",
  "ក្ឃ​ខ្ឃ​គ្ឃ​ឃ្ឃ​ង្ឃ​ច្ឃ​ឆ្ឃ​ជ្ឃ​ឈ្ឃ​ញ្ឃ​ដ្ឃ​ឋ្ឃ​ឌ្ឃ​ឍ្ឃ​ត្ឃ​ថ្ឃ​ទ្ឃ​ធ្ឃ​ន្ឃ​ប្ឃ​ផ្ឃ​ព្ឃ​ភ្ឃ​ម្ឃ​យ្ឃ​រ្ឃ​ល្ឃ​វ្ឃ​ឝ្ឃ​ឞ្ឃ​ស្ឃ​ហ្ឃ​អ្ឃ​",
  "ក្ង​ខ្ង​គ្ង​ឃ្ង​ង្ង​ច្ង​ឆ្ង​ជ្ង​ឈ្ង​ញ្ង​ដ្ង​ឋ្ង​ឌ្ង​ឍ្ង​ត្ង​ថ្ង​ទ្ង​ធ្ង​ន្ង​ប្ង​ផ្ង​ព្ង​ភ្ង​ម្ង​យ្ង​រ្ង​ល្ង​វ្ង​ឝ្ង​ឞ្ង​ស្ង​ហ្ង​អ្ង​",
  "ក្ច​ខ្ច​គ្ច​ឃ្ច​ង្ច​ច្ច​ឆ្ច​ជ្ច​ឈ្ច​ញ្ច​ដ្ច​ឋ្ច​ឌ្ច​ឍ្ច​ត្ច​ថ្ច​ទ្ច​ធ្ច​ន្ច​ប្ច​ផ្ច​ព្ច​ភ្ច​ម្ច​យ្ច​រ្ច​ល្ច​វ្ច​ឝ្ច​ឞ្ច​ស្ច​ហ្ច​អ្ច​",
  "ក្ឆ​ខ្ឆ​គ្ឆ​ឃ្ឆ​ង្ឆ​ច្ឆ​ឆ្ឆ​ជ្ឆ​ឈ្ឆ​ញ្ឆ​ដ្ឆ​ឋ្ឆ​ឌ្ឆ​ឍ្ឆ​ត្ឆ​ថ្ឆ​ទ្ឆ​ធ្ឆ​ន្ឆ​ប្ឆ​ផ្ឆ​ព្ឆ​ភ្ឆ​ម្ឆ​យ្ឆ​រ្ឆ​ល្ឆ​វ្ឆ​ឝ្ឆ​ឞ្ឆ​ស្ឆ​ហ្ឆ​អ្ឆ​",
  "ក្ជ​ខ្ជ​គ្ជ​ឃ្ជ​ង្ជ​ច្ជ​ឆ្ជ​ជ្ជ​ឈ្ជ​ញ្ជ​ដ្ជ​ឋ្ជ​ឌ្ជ​ឍ្ជ​ត្ជ​ថ្ជ​ទ្ជ​ធ្ជ​ន្ជ​ប្ជ​ផ្ជ​ព្ជ​ភ្ជ​ម្ជ​យ្ជ​រ្ជ​ល្ជ​វ្ជ​ឝ្ជ​ឞ្ជ​ស្ជ​ហ្ជ​អ្ជ​",
  "ក្ឈ​ខ្ឈ​គ្ឈ​ឃ្ឈ​ង្ឈ​ច្ឈ​ឆ្ឈ​ជ្ឈ​ឈ្ឈ​ញ្ឈ​ដ្ឈ​ឋ្ឈ​ឌ្ឈ​ឍ្ឈ​ត្ឈ​ថ្ឈ​ទ្ឈ​ធ្ឈ​ន្ឈ​ប្ឈ​ផ្ឈ​ព្ឈ​ភ្ឈ​ម្ឈ​យ្ឈ​រ្ឈ​ល្ឈ​វ្ឈ​ឝ្ឈ​ឞ្ឈ​ស្ឈ​ហ្ឈ​អ្ឈ​",
  "ក្ញ​ខ្ញ​គ្ញ​ឃ្ញ​ង្ញ​ច្ញ​ឆ្ញ​ជ្ញ​ឈ្ញ​ញ្ញ​ដ្ញ​ឋ្ញ​ឌ្ញ​ឍ្ញ​ត្ញ​ថ្ញ​ទ្ញ​ធ្ញ​ន្ញ​ប្ញ​ផ្ញ​ព្ញ​ភ្ញ​ម្ញ​យ្ញ​រ្ញ​ល្ញ​វ្ញ​ឝ្ញ​ឞ្ញ​ស្ញ​ហ្ញ​អ្ញ​",
  "ក្ដ​ខ្ដ​គ្ដ​ឃ្ដ​ង្ដ​ច្ដ​ឆ្ដ​ជ្ដ​ឈ្ដ​ញ្ដ​ដ្ដ​ឋ្ដ​ឌ្ដ​ឍ្ដ​ត្ដ​ថ្ដ​ទ្ដ​ធ្ដ​ន្ដ​ប្ដ​ផ្ដ​ព្ដ​ភ្ដ​ម្ដ​យ្ដ​រ្ដ​ល្ដ​វ្ដ​ឝ្ដ​ឞ្ដ​ស្ដ​ហ្ដ​អ្ដ​",
  "ក្ឋ​ខ្ឋ​គ្ឋ​ឃ្ឋ​ង្ឋ​ច្ឋ​ឆ្ឋ​ជ្ឋ​ឈ្ឋ​ញ្ឋ​ដ្ឋ​ឋ្ឋ​ឌ្ឋ​ឍ្ឋ​ត្ឋ​ថ្ឋ​ទ្ឋ​ធ្ឋ​ន្ឋ​ប្ឋ​ផ្ឋ​ព្ឋ​ភ្ឋ​ម្ឋ​យ្ឋ​រ្ឋ​ល្ឋ​វ្ឋ​ឝ្ឋ​ឞ្ឋ​ស្ឋ​ហ្ឋ​អ្ឋ​",
  "ក្ឌ​ខ្ឌ​គ្ឌ​ឃ្ឌ​ង្ឌ​ច្ឌ​ឆ្ឌ​ជ្ឌ​ឈ្ឌ​ញ្ឌ​ដ្ឌ​ឋ្ឌ​ឌ្ឌ​ឍ្ឌ​ត្ឌ​ថ្ឌ​ទ្ឌ​ធ្ឌ​ន្ឌ​ប្ឌ​ផ្ឌ​ព្ឌ​ភ្ឌ​ម្ឌ​យ្ឌ​រ្ឌ​ល្ឌ​វ្ឌ​ឝ្ឌ​ឞ្ឌ​ស្ឌ​ហ្ឌ​អ្ឌ​",
  "ក្ឍ​ខ្ឍ​គ្ឍ​ឃ្ឍ​ង្ឍ​ច្ឍ​ឆ្ឍ​ជ្ឍ​ឈ្ឍ​ញ្ឍ​ដ្ឍ​ឋ្ឍ​ឌ្ឍ​ឍ្ឍ​ត្ឍ​ថ្ឍ​ទ្ឍ​ធ្ឍ​ន្ឍ​ប្ឍ​ផ្ឍ​ព្ឍ​ភ្ឍ​ម្ឍ​យ្ឍ​រ្ឍ​ល្ឍ​វ្ឍ​ឝ្ឍ​ឞ្ឍ​ស្ឍ​ហ្ឍ​អ្ឍ​",
  "ក្ត​ខ្ត​គ្ត​ឃ្ត​ង្ត​ច្ត​ឆ្ត​ជ្ត​ឈ្ត​ញ្ត​ដ្ត​ឋ្ត​ឌ្ត​ឍ្ត​ត្ត​ថ្ត​ទ្ត​ធ្ត​ន្ត​ប្ត​ផ្ត​ព្ត​ភ្ត​ម្ត​យ្ត​រ្ត​ល្ត​វ្ត​ឝ្ត​ឞ្ត​ស្ត​ហ្ត​អ្ត​",
  "ក្ថ​ខ្ថ​គ្ថ​ឃ្ថ​ង្ថ​ច្ថ​ឆ្ថ​ជ្ថ​ឈ្ថ​ញ្ថ​ដ្ថ​ឋ្ថ​ឌ្ថ​ឍ្ថ​ត្ថ​ថ្ថ​ទ្ថ​ធ្ថ​ន្ថ​ប្ថ​ផ្ថ​ព្ថ​ភ្ថ​ម្ថ​យ្ថ​រ្ថ​ល្ថ​វ្ថ​ឝ្ថ​ឞ្ថ​ស្ថ​ហ្ថ​អ្ថ​",
  "ក្ទ​ខ្ទ​គ្ទ​ឃ្ទ​ង្ទ​ច្ទ​ឆ្ទ​ជ្ទ​ឈ្ទ​ញ្ទ​ដ្ទ​ឋ្ទ​ឌ្ទ​ឍ្ទ​ត្ទ​ថ្ទ​ទ្ទ​ធ្ទ​ន្ទ​ប្ទ​ផ្ទ​ព្ទ​ភ្ទ​ម្ទ​យ្ទ​រ្ទ​ល្ទ​វ្ទ​ឝ្ទ​ឞ្ទ​ស្ទ​ហ្ទ​អ្ទ​",
  "ក្ធ​ខ្ធ​គ្ធ​ឃ្ធ​ង្ធ​ច្ធ​ឆ្ធ​ជ្ធ​ឈ្ធ​ញ្ធ​ដ្ធ​ឋ្ធ​ឌ្ធ​ឍ្ធ​ត្ធ​ថ្ធ​ទ្ធ​ធ្ធ​ន្ធ​ប្ធ​ផ្ធ​ព្ធ​ភ្ធ​ម្ធ​យ្ធ​រ្ធ​ល្ធ​វ្ធ​ឝ្ធ​ឞ្ធ​ស្ធ​ហ្ធ​អ្ធ​",
  "ក្ន​ខ្ន​គ្ន​ឃ្ន​ង្ន​ច្ន​ឆ្ន​ជ្ន​ឈ្ន​ញ្ន​ដ្ន​ឋ្ន​ឌ្ន​ឍ្ន​ត្ន​ថ្ន​ទ្ន​ធ្ន​ន្ន​ប្ន​ផ្ន​ព្ន​ភ្ន​ម្ន​យ្ន​រ្ន​ល្ន​វ្ន​ឝ្ន​ឞ្ន​ស្ន​ហ្ន​អ្ន​",
  "ក្ប​ខ្ប​គ្ប​ឃ្ប​ង្ប​ច្ប​ឆ្ប​ជ្ប​ឈ្ប​ញ្ប​ដ្ប​ឋ្ប​ឌ្ប​ឍ្ប​ត្ប​ថ្ប​ទ្ប​ធ្ប​ន្ប​ប្ប​ផ្ប​ព្ប​ភ្ប​ម្ប​យ្ប​រ្ប​ល្ប​វ្ប​ឝ្ប​ឞ្ប​ស្ប​ហ្ប​អ្ប​",
  "ក្ផ​ខ្ផ​គ្ផ​ឃ្ផ​ង្ផ​ច្ផ​ឆ្ផ​ជ្ផ​ឈ្ផ​ញ្ផ​ដ្ផ​ឋ្ផ​ឌ្ផ​ឍ្ផ​ត្ផ​ថ្ផ​ទ្ផ​ធ្ផ​ន្ផ​ប្ផ​ផ្ផ​ព្ផ​ភ្ផ​ម្ផ​យ្ផ​រ្ផ​ល្ផ​វ្ផ​ឝ្ផ​ឞ្ផ​ស្ផ​ហ្ផ​អ្ផ​",
  "ក្ព​ខ្ព​គ្ព​ឃ្ព​ង្ព​ច្ព​ឆ្ព​ជ្ព​ឈ្ព​ញ្ព​ដ្ព​ឋ្ព​ឌ្ព​ឍ្ព​ត្ព​ថ្ព​ទ្ព​ធ្ព​ន្ព​ប្ព​ផ្ព​ព្ព​ភ្ព​ម្ព​យ្ព​រ្ព​ល្ព​វ្ព​ឝ្ព​ឞ្ព​ស្ព​ហ្ព​អ្ព​",
  "ក្ភ​ខ្ភ​គ្ភ​ឃ្ភ​ង្ភ​ច្ភ​ឆ្ភ​ជ្ភ​ឈ្ភ​ញ្ភ​ដ្ភ​ឋ្ភ​ឌ្ភ​ឍ្ភ​ត្ភ​ថ្ភ​ទ្ភ​ធ្ភ​ន្ភ​ប្ភ​ផ្ភ​ព្ភ​ភ្ភ​ម្ភ​យ្ភ​រ្ភ​ល្ភ​វ្ភ​ឝ្ភ​ឞ្ភ​ស្ភ​ហ្ភ​អ្ភ​",
  "ក្ម​ខ្ម​គ្ម​ឃ្ម​ង្ម​ច្ម​ឆ្ម​ជ្ម​ឈ្ម​ញ្ម​ដ្ម​ឋ្ម​ឌ្ម​ឍ្ម​ត្ម​ថ្ម​ទ្ម​ធ្ម​ន្ម​ប្ម​ផ្ម​ព្ម​ភ្ម​ម្ម​យ្ម​រ្ម​ល្ម​វ្ម​ឝ្ម​ឞ្ម​ស្ម​ហ្ម​អ្ម​",
  "ក្យ​ខ្យ​គ្យ​ឃ្យ​ង្យ​ច្យ​ឆ្យ​ជ្យ​ឈ្យ​ញ្យ​ដ្យ​ឋ្យ​ឌ្យ​ឍ្យ​ត្យ​ថ្យ​ទ្យ​ធ្យ​ន្យ​ប្យ​ផ្យ​ព្យ​ភ្យ​ម្យ​យ្យ​រ្យ​ល្យ​វ្យ​ឝ្យ​ឞ្យ​ស្យ​ហ្យ​អ្យ​",
  "ក្រ​ខ្រ​គ្រ​ឃ្រ​ង្រ​ច្រ​ឆ្រ​ជ្រ​ឈ្រ​ញ្រ​ដ្រ​ឋ្រ​ឌ្រ​ឍ្រ​ត្រ​ថ្រ​ទ្រ​ធ្រ​ន្រ​ប្រ​ផ្រ​ព្រ​ភ្រ​ម្រ​យ្រ​រ្រ​ល្រ​វ្រ​ឝ្រ​ឞ្រ​ស្រ​ហ្រ​អ្រ​",
  "ក្ល​ខ្ល​គ្ល​ឃ្ល​ង្ល​ច្ល​ឆ្ល​ជ្ល​ឈ្ល​ញ្ល​ដ្ល​ឋ្ល​ឌ្ល​ឍ្ល​ត្ល​ថ្ល​ទ្ល​ធ្ល​ន្ល​ប្ល​ផ្ល​ព្ល​ភ្ល​ម្ល​យ្ល​រ្ល​ល្ល​វ្ល​ឝ្ល​ឞ្ល​ស្ល​ហ្ល​អ្ល​",
  "ក្វ​ខ្វ​គ្វ​ឃ្វ​ង្វ​ច្វ​ឆ្វ​ជ្វ​ឈ្វ​ញ្វ​ដ្វ​ឋ្វ​ឌ្វ​ឍ្វ​ត្វ​ថ្វ​ទ្វ​ធ្វ​ន្វ​ប្វ​ផ្វ​ព្វ​ភ្វ​ម្វ​យ្វ​រ្វ​ល្វ​វ្វ​ឝ្វ​ឞ្វ​ស្វ​ហ្វ​អ្វ​",
  "ក្ឝ​ខ្ឝ​គ្ឝ​ឃ្ឝ​ង្ឝ​ច្ឝ​ឆ្ឝ​ជ្ឝ​ឈ្ឝ​ញ្ឝ​ដ្ឝ​ឋ្ឝ​ឌ្ឝ​ឍ្ឝ​ត្ឝ​ថ្ឝ​ទ្ឝ​ធ្ឝ​ន្ឝ​ប្ឝ​ផ្ឝ​ព្ឝ​ភ្ឝ​ម្ឝ​យ្ឝ​រ្ឝ​ល្ឝ​វ្ឝ​ឝ្ឝ​ឞ្ឝ​ស្ឝ​ហ្ឝ​អ្ឝ​",
  "ក្ឞ​ខ្ឞ​គ្ឞ​ឃ្ឞ​ង្ឞ​ច្ឞ​ឆ្ឞ​ជ្ឞ​ឈ្ឞ​ញ្ឞ​ដ្ឞ​ឋ្ឞ​ឌ្ឞ​ឍ្ឞ​ត្ឞ​ថ្ឞ​ទ្ឞ​ធ្ឞ​ន្ឞ​ប្ឞ​ផ្ឞ​ព្ឞ​ភ្ឞ​ម្ឞ​យ្ឞ​រ្ឞ​ល្ឞ​វ្ឞ​ឝ្ឞ​ឞ្ឞ​ស្ឞ​ហ្ឞ​អ្ឞ​",
  "ក្ស​ខ្ស​គ្ស​ឃ្ស​ង្ស​ច្ស​ឆ្ស​ជ្ស​ឈ្ស​ញ្ស​ដ្ស​ឋ្ស​ឌ្ស​ឍ្ស​ត្ស​ថ្ស​ទ្ស​ធ្ស​ន្ស​ប្ស​ផ្ស​ព្ស​ភ្ស​ម្ស​យ្ស​រ្ស​ល្ស​វ្ស​ឝ្ស​ឞ្ស​ស្ស​ហ្ស​អ្ស​",
  "ក្ហ​ខ្ហ​គ្ហ​ឃ្ហ​ង្ហ​ច្ហ​ឆ្ហ​ជ្ហ​ឈ្ហ​ញ្ហ​ដ្ហ​ឋ្ហ​ឌ្ហ​ឍ្ហ​ត្ហ​ថ្ហ​ទ្ហ​ធ្ហ​ន្ហ​ប្ហ​ផ្ហ​ព្ហ​ភ្ហ​ម្ហ​យ្ហ​រ្ហ​ល្ហ​វ្ហ​ឝ្ហ​ឞ្ហ​ស្ហ​ហ្ហ​អ្ហ​",
  "ក្អ​ខ្អ​គ្អ​ឃ្អ​ង្អ​ច្អ​ឆ្អ​ជ្អ​ឈ្អ​ញ្អ​ដ្អ​ឋ្អ​ឌ្អ​ឍ្អ​ត្អ​ថ្អ​ទ្អ​ធ្អ​ន្អ​ប្អ​ផ្អ​ព្អ​ភ្អ​ម្អ​យ្អ​រ្អ​ល្អ​វ្អ​ឝ្អ​ឞ្អ​ស្អ​ហ្អ​អ្អ​ ណ្ណ ស្ណ ឝ្ណ",
"",
  "Title: Coeng Forms and Below-base Vowels",
  "ក្កុ​ក្ខុ​ក្គុ​ក្ឃុ​ក្ងុ​ក្ចុ​ក្ឆុ​ក្ជុ​ក្ឈុ​ក្ញុ​ក្ដុ​ក្ឋុ​ក្ឌុ​ក្ឍុ​ក្ណុ​ក្តុ​ក្ថុ​ក្ទុ​ក្ធុ​ក្នុ​ក្បុ​ក្ផុ​ក្ពុ​ក្ភុ​ក្មុ​ក្យុ​ក្រុ​ក្លុ​ក្វុ​ក្ឝុ​ក្ឞុ​ក្សុ​ក្ហុ​ក្អុ​",
  "ស្កុ​ស្ខុ​ស្គុ​ស្ឃុ​ស្ងុ​ស្ចុ​ស្ឆុ​ស្ជុ​ស្ឈុ​ស្ញុ​ស្ដុ​ស្ឋុ​ស្ឌុ​ស្ឍុ​ស្ណុ​ស្តុ​ស្ថុ​ស្ទុ​ស្ធុ​ស្នុ​ស្បុ​ស្ផុ​ស្ពុ​ស្ភុ​ស្មុ​ស្យុ​ស្រុ​ស្លុ​ស្វុ​ស្ឝុ​ស្ឞុ​ស្សុ​ស្ហុ​ស្អុ​",
  "ណ្កុ​ណ្ខុ​ណ្គុ​ណ្ឃុ​ណ្ងុ​ណ្ចុ​ណ្ឆុ​ណ្ជុ​ណ្ឈុ​ណ្ញុ​ណ្ដុ​ណ្ឋុ​ណ្ឌុ​ណ្ឍុ​ណ្ណុ​ណ្តុ​ណ្ថុ​ណ្ទុ​ណ្ធុ​ណ្នុ​ណ្បុ​ណ្ផុ​ណ្ពុ​ណ្ភុ​ណ្មុ​ណ្យុ​ណ្រុ​ណ្លុ​ណ្វុ​",
  "ណ្ឝុ​ណ្ឞុ​ណ្សុ​ណ្ហុ​ណ្អុ​",
  "ក្កូ​ក្ខូ​ក្គូ​ក្ឃូ​ក្ងូ​ក្ចូ​ក្ឆូ​ក្ជូ​ក្ឈូ​ក្ញូ​ក្ដូ​ក្ឋូ​ក្ឌូ​ក្ឍូ​ក្ណូ​ក្តូ​ក្ថូ​ក្ទូ​ក្ធូ​ក្នូ​ក្បូ​ក្ផូ​ក្ពូ​ក្ភូ​ក្មូ​ក្យូ​ក្រូ​ក្លូ​ក្វូ​ក្ឝូ​ក្ឞូ​ក្សូ​ក្ហូ​ក្អូ​",
  "ស្កូ​ស្ខូ​ស្គូ​ស្ឃូ​ស្ងូ​ស្ចូ​ស្ឆូ​ស្ជូ​ស្ឈូ​ស្ញូ​ស្ដូ​ស្ឋូ​ស្ឌូ​ស្ឍូ​ស្ណូ​ស្តូ​ស្ថូ​ស្ទូ​ស្ធូ​ស្នូ​ស្បូ​ស្ផូ​ស្ពូ​ស្ភូ​ស្មូ​ស្យូ​ស្រូ​ស្លូ​ស្វូ​ស្ឝូ​ស្ឞូ​ស្សូ​ស្ហូ​ស្អូ​",
  "ណ្កូ​ណ្ខូ​ណ្គូ​ណ្ឃូ​ណ្ងូ​ណ្ចូ​ណ្ឆូ​ណ្ជូ​ណ្ឈូ​ណ្ញូ​ណ្ដូ​ណ្ឋូ​ណ្ឌូ​ណ្ឍូ​ណ្ណូ​ណ្តូ​ណ្ថូ​ណ្ទូ​ណ្ធូ​ណ្នូ​ណ្បូ​ណ្ផូ​ណ្ពូ​ណ្ភូ​ណ្មូ​ណ្យូ​ណ្រូ​ណ្លូ​ណ្វូ"
  "ណ្ឝូ​ណ្ឞូ​ណ្សូ​ណ្ហូ​ណ្អូ​",
  "ក្កួ​ក្ខួ​ក្គួ​ក្ឃួ​ក្ងួ​ក្ចួ​ក្ឆួ​ក្ជួ​ក្ឈួ​ក្ញួ​ក្ដួ​ក្ឋួ​ក្ឌួ​ក្ឍួ​ក្ណួ​ក្តួ​ក្ថួ​ក្ទួ​ក្ធួ​ក្នួ​ក្បួ​ក្ផួ​ក្ពួ​ក្ភួ​ក្មួ​ក្យួ​ក្រួ​ក្លួ​ក្វួ​ក្ឝួ​ក្ឞួ​ក្សួ​ក្ហួ​ក្អួ​",
  "ស្កួ​ស្ខួ​ស្គួ​ស្ឃួ​ស្ងួ​ស្ចួ​ស្ឆួ​ស្ជួ​ស្ឈួ​ស្ញួ​ស្ដួ​ស្ឋួ​ស្ឌួ​ស្ឍួ​ស្ណួ​ស្តួ​ស្ថួ​ស្ទួ​ស្ធួ​ស្នួ​ស្បួ​ស្ផួ​ស្ពួ​ស្ភួ​ស្មួ​ស្យួ​ស្រួ​ស្លួ​ស្វួ​ស្ឝួ​ស្ឞួ​ស្សួ​ស្ហួ​ស្អួ​",
  "ណ្កួ​ណ្ខួ​ណ្គួ​ណ្ឃួ​ណ្ងួ​ណ្ចួ​ណ្ឆួ​ណ្ជួ​ណ្ឈួ​ណ្ញួ​ណ្ដួ​ណ្ឋួ​ណ្ឌួ​ណ្ឍួ​ណ្ណួ​ណ្តួ​ណ្ថួ​ណ្ទួ​ណ្ធួ​ណ្នួ​ណ្បួ​ណ្ផួ​ណ្ពួ​ណ្ភួ​ណ្មួ​ណ្យួ​ណ្រួ​ណ្លួ​ណ្វួ","​ណ្ឝួ​ណ្ឞួ​ណ្សួ​ណ្ហួ​ណ្អួ​",
"",
  "Title: Coeng RO and Below-base Vowels",
  "ក្រុក្រូក្រួ ខ្រុខ្រូខ្រួ គ្រុគ្រូគ្រួ ឃ្រុឃ្រូឃ្រួ ង្រុង្រូង្រួ ច្រុច្រូច្រួ ឆ្រុឆ្រូឆ្រួ ជ្រុជ្រូជ្រួ ឈ្រុឈ្រូឈ្រួ ញ្រុញ្រូញ្រួ",
  "ដ្រុដ្រូដ្រួ ឋ្រុឋ្រូឋ្រួ ឌ្រុឌ្រូឌ្រួ ឍ្រុឍ្រូឍ្រួ ណ្រុណ្រូណ្រួ ត្រុត្រូត្រួ ថ្រុថ្រូថ្រួ ទ្រុទ្រូទ្រួ ធ្រុធ្រូធ្រួ ន្រុន្រូន្រួ ប្រុប្រូប្រួ",
  "ផ្រុផ្រូផ្រួ ព្រុព្រូព្រួ ភ្រុភ្រូភ្រួ ម្រុម្រូម្រួ យ្រុយ្រូយ្រួ រ្រុរ្រូរ្រួ ល្រុល្រូល្រួ វ្រុវ្រូវ្រួ ឝ្រុឝ្រូឝ្រួ ឞ្រុឞ្រូឞ្រួ ស្រុស្រូស្រួ ហ្រុហ្រូហ្រួ",
  "ឡ្រុឡ្រូឡ្រួ អ្រុអ្រូអ្រួ ក្ក្រុក្ក្រូក្ក្រួ ន្ទ្រុន្ទ្រូន្ទ្រួ ចម្រៀង ចង្ក្រៀង ចង្ក្រឿង ក្នុងអង្រួនទ្រូង",
"",
  "Title: Coeng RO and Coeng Forms",
  "ក្ក្រ​ក្ខ្រ​ក្គ្រ​ក្ឃ្រ​ក្ង្រ​ក្ច្រ​ក្ឆ្រ​ក្ជ្រ​ក្ឈ្រ​ក្ញ្រ​ក្ដ្រ​ក្ឋ្រ​ក្ឌ្រ​ក្ឍ្រ​ក្ណ្រ​ក្ត្រ​ក្ថ្រ​ក្ទ្រ​ក្ធ្រ​ក្ន្រ​ក្ប្រ​ក្ផ្រ​ក្ព្រ​ក្ភ្រ​ក្ម្រ​ក្យ្រ​​ក្ល្រ​ក្វ្រ​ក្ឝ្រ​ក្ឞ្រ​ក្ស្រ​ក្ហ្រ​ក្អ្រ",
  "ស្ក្រ​ស្ខ្រ​ស្គ្រ​ស្ឃ្រ​ស្ង្រ​ស្ច្រ​ស្ឆ្រ​ស្ជ្រ​ស្ឈ្រ​ស្ញ្រ​ស្ដ្រ​ស្ឋ្រ​ស្ឌ្រ​ស្ឍ្រ​ស្ណ្រ​ស្ត្រ​ស្ថ្រ​ស្ទ្រ​ស្ធ្រ​ស្ន្រ​ស្ប្រ​ស្ផ្រ​ស្ព្រ​ស្ភ្រ​ស្ម្រ​ស្យ្រ​​ស្ល្រ​ស្វ្រ​ស្ឝ្រ​ស្ឞ្រ​ស្ស្រ​ស្ហ្រ​ស្អ្រ",
  "​​ណ្ក្រ​ណ្ខ្រ​ណ្គ្រ​ណ្ឃ្រ​ណ្ង្រ​ណ្ច្រ​ណ្ឆ្រ​ណ្ជ្រ​ណ្ឈ្រ​ណ្ញ្រ​ណ្ដ្រ​ណ្ឋ្រ​ណ្ឌ្រ​ណ្ឍ្រ​ណ្ណ្រ​ណ្ត្រ​ណ្ថ្រ​ណ្ទ្រ​ណ្ធ្រ​ណ្ន្រ​ណ្ប្រ​ណ្ផ្រ​ណ្ព្រ​ណ្ភ្រ​ណ្ម្រ​ណ្យ្រ​​ណ្ល្រ​ណ្វ្រ​ណ្ឝ្រ​ណ្ឞ្រ​ណ្ស្រ​ណ្ហ្រ​ណ្អ្រ​",
"",
  "Title: Ligature Forms",
  "កាកាំក៉ាកោកៅក៉ោក៉ៅ ខាខាំខ៉ាខោខៅខ៉ោខ៉ៅ គាគាំគ៉ាគោគៅគ៉ោគ៉ៅ",
  "ឃាឃាំឃ៉ាឃោឃៅឃ៉ោឃ៉ៅ ងាងាំង៉ាងោងៅង៉ោង៉ៅ ចាចាំច៉ាចោចៅច៉ោច៉ៅ",
  "ឆាឆាំឆ៉ាឆោឆៅឆ៉ោឆ៉ៅ ជាជាំជ៉ាជោជៅជ៉ោជ៉ៅ ឈាឈាំឈ៉ាឈោឈៅឈ៉ោឈ៉ៅ",
  "ញាញាំញ៉ាញោញៅញ៉ោញ៉ៅ ដាដាំដ៉ាដោដៅដ៉ោដ៉ៅ ឋាឋាំឋ៉ាឋោឋៅឋ៉ោឋ៉ៅ",
  "ឌាឌាំឌ៉ាឌោឌៅឌ៉ោឌ៉ៅ ឍាឍាំឍ៉ាឍោឍៅឍ៉ោឍ៉ៅ ណាណាំណ៉ាណោណៅណ៉ោណ៉ៅ",
  "តាតាំត៉ាតោតៅត៉ោត៉ៅ ថាថាំថ៉ាថោថៅថ៉ោថ៉ៅ ទាទាំទ៉ាទោទៅទ៉ោទ៉ៅ",
  "ធាធាំធ៉ាធោធៅធ៉ោធ៉ៅ នានាំន៉ានោនៅន៉ោន៉ៅ បាបាំប៉ាបោបៅប៉ោប៉ៅ",
  "ផាផាំផ៉ាផោផៅផ៉ោផ៉ៅ ពាពាំព៉ាពោពៅព៉ោព៉ៅ ភាភាំភ៉ាភោភៅភ៉ោភ៉ៅ",
  "មាមាំម៉ាមោមៅម៉ោម៉ៅ យាយាំយ៉ាយោយៅយ៉ោយ៉ៅ រារាំរ៉ារោរៅរ៉ោរ៉ៅ",
  "លាលាំល៉ាលោលៅល៉ោល៉ៅ វាវាំវ៉ាវោវៅវ៉ោវ៉ៅ ឝាឝាំឝ៉ាឝោឝៅឝ៉ោឝ៉ៅ",
  "ឞាឞាំឞ៉ាឞោឞៅឞ៉ោឞ៉ៅ សាសាំស៉ាសោសៅស៉ោស៉ៅ ហាហាំហ៉ាហោហៅហ៉ោហ៉ៅ",
  "ឡាឡាំឡ៉ាឡោឡៅឡ៉ោឡ៉ៅ អាអាំអ៉ាអោអៅអ៉ោអ៉ៅ",
"",
  "ក្ឃាក្ឃាំក្ឃ៉ាក្ឃោក្ឃៅក្ឃ៉ោក្ឃ៉ៅ ក្ឈាក្ឈាំក្ឈ៉ាក្ឈោក្ឈៅក្ឈ៉ោក្ឈ៉ៅ ក្ឍាក្ឍាំក្ឍ៉ាក្ឍោក្ឍៅក្ឍ៉ោក្ឍ៉ៅ",
  "ក្បាក្បាំក្ប៉ាក្បោក្បៅក្ប៉ោក្ប៉ៅ ក្យាក្យាំក្យ៉ាក្យោក្យៅក្យ៉ោក្យ៉ៅ ក្ឞាក្ឞាំក្ឞ៉ាក្ឞោក្ឞៅក្ឞ៉ោក្ឞ៉ៅ",
  "ក្សាក្សាំក្ស៉ាក្សោក្សៅក្ស៉ោក្ស៉ៅ",
"",
  "Title: Consonant Shifters",
  "ត្រីស័ព្ទ",
  "ស៊ី ស្ស៊ី ហ៊ី អ៊ី ស្ក៊ី ស្ស៊ី ហ្ក៊ី អ្ក៊ី ស៊ាំ ស្ស៊ាំ ហ៊ាំ អ៊ាំ ស្ក៊ាំ ស្ស៊ាំ ហ្ក៊ាំ អ្ក៊ាំ",
"",
  "មូសិកទន្ត (ធ្មេញកណ្ដុរ)",
  "ង៉ី ញ៉ី ន៉ី ប៉ី ប្ប៉ី ម៉ី យ៉ី យ្យ៉ី រ៉ី ល៉ី វ៉ី ង៉ាំ ញ៉ាំ ន៉ាំ ប៉ាំ ប្ប៉ាំ ម៉ាំ យ៉ាំ យ្យ៉ាំ រ៉ាំ ល៉ាំ វ៉ាំ ង៉័ ញ៉័ ន៉័ ប៉័ ប្ប៉័ ម៉័ យ៉័ យ្យ៉័ រ៉័ ល៉័ វ៉័",
"",
  "Title: Collision Test",
  "រិ រី រឹ រឺ វិ វី វឹ វឺ កិ៍ រិ៍ កើ រើ ទុរ្ភ",
  "រ៉ វ៉ រ៉េ រ៉ែ រ៉ៃ វ៉េ វ៉ែ វ៉ៃ កុរ្ព សុរ្ព ទុរ្ភិក្ស",
  "វិរិ រិវិ ជរិជរីជរឹជរឺ ជីវី វរ្ម័ន ទុរ្ភិក្ស អសិរ្ពិស កេរ្តិ៍​",
  "រុក្ករុ រូក្ករូ រួក្ករួ រុក្លរុ រូក្លរូ រួក្លរួ រុក្ហរុ រូក្ហរូ រួក្ហរួ",
  "រុក្ញរុ រូក្ញរូ រួក្ញរួ រុក្វរុ រូក្វរូ រួក្វរួ ទុរ្ភ ទូរ្ភ ទួរ្ភ ឱ្យ ឲ្យ ៗរូ",
"",
  "អំអ៊ំ អ៎អ៊៎ អ័អ៊័ រ៉រ៉ា វ៉វ៉ា ក្ឃ៉ក្ឃ៉ា ក្ឈ៉ក្ឈ៉ា ក្ឍ៉ក្ឍ៉ា ក្ប៉ក្ប៉ា ក្យ៉ក្យ៉ា ក្ឞ៉ក្ឞ៉ា ក្ស៉ក្ស៉ា ",
  "ក្កឿក្សឿ​ស្កឿស្សឿ​ណ្កឿ ក្កៀក្សៀ​ស្កៀស្សៀ​ណ្កៀ អ៊ឿអ៊ៀ",
"",
  "ញក្រ ញៀ ញឿ ញរុញវុ ញរូញវូ ញរួញវួ",
  "ប្ប៍នៃ ប្ប៍នែ ជៀស៊ៀ ជឿស៊ឿ",
  "ក្រុក្រូក្រួ ម្ក្រៀ ឡ្ហក្ស្ម ន្ទ្រួក",
  "ពិថ្ងៃ ពីថ្ងៃ ពឹថ្ងៃ ពឺថ្ងៃ ភៅដែ ភៅដៃ",
  "ង្ឃឹ ផ្សិ ជ្ឈិ ផ្ឍិ ជ្យិ ក្សិក្សីក្សឹក្សឺ ផ្សិផ្សីផ្សឹផ្សឺ",
  "ឋ។ វ។ ឋ៕ វ៕",
"",
  "Title: Paragraph",
  "ពិភពនៃការអភិវឌ្ឍសុសវែរតែងតែផ្លាស់ប្ដូរជាបន្តបន្ទាប់។ វាហាក់ដូចជារៀងរាល់ថ្ងៃមាន",
  "បច្ចេកវិទ្យាថ្មីណាមួយកើតឡើង ហើយអ្វីដែលអ្នករៀនពីម្សិលមិញក៏ប្រើការលែងកើតទៅ",
  "វិញ។ នៅក្នុងការផ្លាស់ប្ដូរយ៉ាងលឿននេះ សមត្ថភាពក្នុងការរៀនគឺជារឿងដ៏សំខាន់មិន",
  "អាចចៀសបាន។ អ្នកអភិវឌ្ឍសុសវែរដែលនៅត្រាំត្រែងតែមួយកន្លែងមិនចង់អភិវឌ្ឍ",
  "ជំនាញរបស់ខ្លួនបន្ថែមនោះ មិនយូរទេនឹងត្រូវគេមើលរំលង ពួកគេក៏នឹងមិនអាចទទួល",
  "ឱកាសអនាគតនានា ហើយក៏ត្រូវគេយកទៅឲ្យធ្វើការលើប្រព័ន្ធចាស់ៗដែលសល់ពី",
  "អតីតកាល។ ប្រសិនបើអ្នកមិនចង់ជួបជោគវាសនាយ៉ាងហ្នឹងទេ អ្នកត្រូវតែរៀនអំពី",
  "របៀបរៀន។ នៅក្នុងជំពូកនេះ គោលដៅរបស់ខ្ញុំគឺបង្រៀនអ្នកអំពីវិធីបង្រៀនខ្លួនឯង។ ខ្ញុំ",
  "នឹងនាំអ្នកឲ្យស្គាល់ដំណើរការ ១០ជំហាន ដែលខ្ញុំបានបង្កើតឡើងដើម្បីអាចរៀនបច្ចេក",
  "វិទ្យាថ្មីៗបានក្នុងពេលដ៏ខ្លី។ ហើយដំណើរការមួយនេះ ខ្ញុំបានយកទៅបង្កើតជាមេរៀន",
  "បណ្ដុះបណ្ដាលបានជាង ៣០ ក្នុងពេលតិចជាងមួយឆ្នាំ។ ខ្ញុំក៏នឹងផ្ដល់ឲ្យអ្នកនូវដំបូន្មាន",
  "ល្អៗអំពីការស្វែងរកអ្នកណែនាំ អំពីការណែនាំអ្នកដទៃវិញ និងអំពីវិធីបំផុសឲ្យចេញនូវ",
  "សក្ដានុពលដែលមាននៅក្នុងខ្លួនរបស់អ្នក ដើម្បីអាចក្រេបយកព័ត៌មានផ្សេងៗឲ្យដូចអេ",
  "ប៉ុងជក់ទឹក។ វាគ្មានអ្វីទាស់ខុសក្នុងការទៅរៀននៅសាលាហើយទទួលបានការអប់រំល្អ",
  "នោះទេ ប៉ុន្តែប្រសិនណាបើការអប់រំរបស់អ្នកវាចប់នៅពេលទទួលសញ្ញាបត្រនោះ អ្នក",
  "នឹងធ្លាក់ចូលទៅក្នុងគុណវិបត្តិដ៏ស្ដែងមួយនៅក្នុងជីវិត។ ការពិតទៅ ប្រសិនបើអ្នកពឹងតែ",
  "លើការបង្រៀនពីអ្នកដទៃ ហើយអ្នកមិនព្រមរៀនអំពីការបង្រៀនខ្លួនឯងទេនោះ មានន័យ",
  "ថាអ្នកកំពុងតែកម្រិតលទ្ធភាពទទួលបានឱកាសក្នុងការអភិវឌ្ឍជំនាញនិងចំណេះដឹង",
  "របស់អ្នកហើយ។ ជំនាញដ៏សំខាន់មួយដែលអ្នកអភិវឌ្ឍសុសវែរអាចរៀនបាននោះគឺ",
  "ជំនាញបង្រៀនខ្លួនឯង។ ការអប់រំខ្លួនឯង គឺជំនាញដ៏ចាំបាច់មួយនៅក្នុងពិភពដែលបច្ចេក",
  "វិទ្យាកើតមានថ្មីៗសឹងតែរាល់ថ្ងៃ និងដែលអ្នកអភិវឌ្ឍវេបធម្មតាម្នាក់ត្រូវបានរំពឹងទុកថា",
  "ចេះយ៉ាងតិចបីភាសា ដើម្បីអាចចូលក្នុងបញ្ជីនៃការពិចារណាចំពោះតំណែងកម្រិតដំបូង។"
};

int main(void)
{
  int x = 0;
  int list_size;
  int k;
  int num_row = 11;

  list_size = sizeof(str)/8;

  // printf("list_size=%d\n\r", list_size);
  
  u8g2_SetupBuffer_SDL_128x64(&u8g2, &u8g2_cb_r0);
  u8x8_InitDisplay(u8g2_GetU8x8(&u8g2));
  u8x8_SetPowerSave(u8g2_GetU8x8(&u8g2), 0);  

  u8g2_SetFontMode(&u8g2, 1);  // Transparent

  u8g2_SetFontDirection(&u8g2, 0);
  // u8g2_SetFont(&u8g2, notosans_6x9);
  // u8g2_SetFont(&u8g2, notosans_6x8);
  // u8g2_SetFont(&u8g2, u8g2KHTest_R16);
  u8g2_SetFont(&u8g2, khmerR12);

  while (1)
  {
    u8g2_ClearBuffer(&u8g2);
    for (int i = 0; i < num_row; ++i)
    {
      if (x+i < list_size) {
        printf("------------ Display line %d:\n", x+i+1);
        u8g2_DrawKhmer(&u8g2, 0, 14+21*i, str[x+i]);
      }
      else {
        u8g2_DrawKhmer(&u8g2, 0, 14+21*i, "");
      }
    }

    u8g2_SendBuffer(&u8g2);

    do
    {
      k = u8g_sdl_get_key();
      sleep(0.01);
    } while( k == -1);

     /* Close window event */
    if (k == 'q') return 0;
    else if (k == 'j')
    {
      /* Display the next n rows in the list */
      x += num_row; 
      if (x > list_size-1) x = 0;
    }
    else if (k == 'k')
    {
      /* Display the previous n rows in the list */
      x -= num_row; 
      if (x < 0) 
      {
        if (list_size % num_row == 0) x = list_size - num_row;
        else x = list_size - (list_size % num_row);
      }

    }
    else if (k == 't')
    {
      /* Return the top of the list */
      x = 0;
    }
  }

}

